#include <stdio.h>

int main() {
    int y1, m1, d1; 
    int y2, m2, d2; 

    
    printf("Введіть рік, місяць та день народження першої людини (у мм дд): ");
    scanf("%d %d %d", &y1, &m1, &d1);
  
    printf("Введіть рік, місяць та день народження другої людини (у мм дд): ");
    scanf("%d %d %d", &y2, &m2, &d2);

    // Перевіряємо, хто старший і на скільки повних місяців
    if (y1 < y2) {
        printf("Перша людина старша за другу на %d повних місяців.", (y2 - y1) * 12 + (m2 - m1));
    } else if (y1 > y2) {
        printf("Друга людина старша за першу на %d повних місяців.", (y1 - y2) * 12 + (m1 - m2));
    } else {
        if (m1 < m2) {
            printf("Перша людина старша за другу на %d повних місяців.", m2 - m1);
        } else if (m1 > m2) {
            printf("Друга людина старша за першу на %d повних місяців.", m1 - m2);
        } else {
            if (d1 < d2) {
                printf("Перша людина старша за другу на менше ніж повний місяць.");
            } else if (d1 > d2) {
                printf("Друга людина старша за першу на менше ніж повний місяць.");
            } else {
                printf("Обидві людини народилися в один і той самий день.");
            }
        }
    }

    return 0;
}
